doc/ТЗ RSS.md

# Table of Contents

1.  [Введение](#orge5c3a06)
2.  [Общее описание](#orgb655410)
    1.  [Данные](#orgb6859cf)
3.  [Api интерфейсы](#orgfa1b7cb)
    1.  [sources](#org61d1b1a)
    2.  [news](#org1bd6712)
    3.  [login](#org26c424d)
    4.  [user](#org5224f40)



<a id="orge5c3a06"></a>

# Введение

Web приложение предназначенное для чтения новостей из различных источников при
помощи технологии RSS.


<a id="orgb655410"></a>

# Общее описание

Для взаимодействия пользователя с приложением используется Web-интерфейс.
Так же для программного взаимодействия присутствует REST-API сервера.
Web-интерфейс использует REST-API для получения и изменения данных.

Приложение имеет следующие функциональные возможности:

-   регистрация и авторизация пользователя
-   возможность добавления источников новостей
-   загрузка новостей из источников
-   возможность тегирования новостей и источников
-   просмотр и фильтрация новостей


<a id="orgb6859cf"></a>

## Данные


<a id="orgfa1b7cb"></a>

# Api интерфейсы

Api имеет архитектуру REST-API.
Необходимы присутствовать следующие ресурсы:

-   sources
-   news
-   login
-   user


<a id="org61d1b1a"></a>

## sources

В данном ресурсе предоставляются источники которые использует пользователь.
Иммет следующие интерфейсы:

-   `GET /sources`
    -   Описание:
        
        Получение списка ресурсов пользователя.
    
    -   Входные параметры:
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        Список обектов с информацией о ресурсах

-   `POST /sources`
    -   Описание:
        
        Добавить ресурс
    
    -   Входные параметры:
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        Информация о добавленом ресурсе.

-   `GET /sources/:idSource`
    -   Описание:
        
        Получить информацию о ресурсе с id
    
    -   Входные параметры:
        
        idSource - id ресурса
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        Информация о ресурсе с id = idSource

-   `DELETE /sources/:idSource`
    -   Описание:
        
        Удалить ресурс с id = idSource из ресурсов пользователя.
    
    -   Входные параметры:
        
        idSource - id ресурса
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        None

-   `PATCH /sources/:idSource`
    -   Описание:
        
        Обновить информацию о ресурсе.
        
        Примечание: после обновления адреса ресурса может изменится
    
    -   Входные параметры:
        
        idSource - id ресурса
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        Информация о изменённом ресурсе с id = idSource

Описание моделей:


<a id="org1bd6712"></a>

## news

В данном ресурсе предоставляются новости пользователя.
Иммет следующие интерфейсы:

-   `GET /news`
    -   Описание:
        
        Получение списка новостей пользователя.
    
    -   Входные параметры:
        
        Параметры авторизации
        
        Необязательные параметры:
        
        -   id ресурса
        -   теги
        -   избранное
        -   прочитано или нет
        -   &#x2026;
    
    -   Выходные параметры:
        
        Список обектов с информацией о новостях

-   `GET /news/:idNews`
    -   Описание:
        
        Получить информацию о новости c id = idNews
    
    -   Входные параметры:
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        Информация о новости с id = idSource

-   `PATCH /news/:idNews`
    -   Описание:
        
        Изменение информации о новости:
        
        -   теги
        -   избранное
        -   прочитано или нет
        -   &#x2026;
    
    -   Входные параметры:
        
        Параметры авторизации
        
        Обновлённые параметры
    
    -   Выходные параметры:
        
        Изменённая информация о новости с id = idSource

-   `DELETE /news/:idNews`
    -   Описание:
        
        Удаляет новость у пользователя
    
    -   Входные параметры:
        
        Параметры авторизации
    
    -   Выходные параметры:
        
        None

Описание моделей:


<a id="org26c424d"></a>

## login

Ресурс для авторизации пользователя
Иммет следующие интерфейсы:

-   `POST /login`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:

Описание моделей:


<a id="org5224f40"></a>

## user

Ресурс для получения информации о пользователях.
Для обычных пользователей доступна информация только о самих себе.
Иммет следующие интерфейсы:

-   `GET /users`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:
-   `POST /users`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:
-   `GET /users/:idUser`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:
-   `PUT /users/:idUser`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:
-   `DELETE /users/:idUser`
    
    -   Описание:
    
    -   Входные параметры:
    
    -   Выходные параметры:

Описание моделей:

